
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Список") И
		НЕ ЗначениеЗаполнено(Параметры.Список)
	Тогда
		ВызватьИсключение "Не задан список выбора.";
	КонецЕсли;
	
	Для Каждого элт Из Параметры.Список Цикл
		стр = Таблица.Добавить();
		стр.Ключ = элт.Значение;
		стр.Значение =  элт.Представление;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбор()
	текДанные = Элементы.Таблица.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		рез = Новый ФиксированнаяСтруктура("Ключ, Значение", текДанные.Ключ, текДанные.Значение);
		ЭтаФорма.Закрыть(рез);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ОбработатьВыбор();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ОбработатьВыбор();
КонецПроцедуры
