#Область РаботаСНастройками

Функция КлючХранилищаНастроекДоступаКElastic()
	Возврат "201905050011elasticLogstashSettings";
КонецФункции


Функция ПолучитьНастройкиДоступаКElastic() Экспорт
	ключ = КлючХранилищаНастроекДоступаКElastic();
	значение = ХранилищеОбщихНастроек.Загрузить(
			ключ,
			ключ,
			Неопределено,
			""
	);
		
	настройки = СтруктураНастроекДоступаКElastic();
	Если ЗначениеЗаполнено(значение) Тогда
		ЗаполнитьЗначенияСвойств(настройки, значение);
	КонецЕсли;
		
	Возврат настройки;
КонецФункции	


Процедура СохранитьНастройкиДоступаКElastic(настройки) Экспорт
	ключ = КлючХранилищаНастроекДоступаКElastic();
	ХранилищеОбщихНастроек.Сохранить(
			ключ,
			ключ,
			настройки,
			Неопределено,
			""
	);		
КонецПроцедуры


Функция СтруктураНастроекДоступаКElastic() Экспорт
	Возврат Новый Структура("АдресСервера, ПортСервера, Сервис, Дебаг, Таймаут, Период, ПортЗапросов", "", 0, "", Ложь, 20, 3600, 9200);
КонецФункции

#КонецОбласти
