#Область ОбработкаФормы

&НаСервере
Процедура КомандаОтправитьЖурналСервер()
	об = РеквизитФормыВЗначение("Объект");
	об.ОтправитьЖРвLogstash();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьЖурнал(Команда)
	КомандаОтправитьЖурналСервер();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)	
	ЗавершитьРаботуСистемы(Ложь, Ложь);
КонецПроцедуры

&НаСервере
Процедура КомандаСохранитьНастройкиНаСервере()
	об = РеквизитФормыВЗначение("Объект");
	настройки = об.СтруктураНастроекДоступаКElastic();
	
	настройки.АдресСервера 	= АдресСервера;
	настройки.ПортСервера	= ПортСервера;
	настройки.Сервис		= Сервис;
	настройки.Дебаг			= Дебаг;
	настройки.Таймаут		= Таймаут;
	настройки.Период		= Период;
	
	об.СохранитьНастройкиДоступаКElastic(настройки);
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьНастройки(Команда)
	КомандаСохранитьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПрочитатьНастройкиНаСервере()
	об = РеквизитФормыВЗначение("Объект");
	настройки = об.ПолучитьНастройкиДоступаКElastic();
	
	АдресСервера = настройки.АдресСервера;
	ПортСервера	 = настройки.ПортСервера;
	Сервис		 = настройки.Сервис;
	Дебаг		 = настройки.Дебаг;
	Период		 = настройки.Период;
	Таймаут		 = настройки.Таймаут;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПрочитатьНастройки(Команда)
	КомандаПрочитатьНастройкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	об = РеквизитФормыВЗначение("Объект");
	КомандаПрочитатьНастройкиНаСервере();
	об.ОтправитьЖРвLogstash();
	ДатаГраницы = об.ПолучитьДатуНижнейГраницыВыгрузкиЖР();	
	//Отказ = Истина;
КонецПроцедуры

#КонецОбласти
